{"project":{"id":2,"title":"Beast1x5","services":["BRAND IDENTITY","WEB DEVELOPMENT","GRAPHIC DESIGN"],"image":"logo_beast1x52.svg","shortdescription":"Brand Material and Video Blog for Video Game Enthusiast","techKeywords":"Wordpress, PHP, MySQL, Twitch API, Youtube API, Bootstrap","externallinks":[{"id":1,"name":"Git","svgref":"git","image":"git-icon.svg","url":"https://github.com/boomtechny"}],"sections":[{"sectionid":1,"sectiontitle":"Overview","subsections":[{"id":1,"title":"Brief","information":"Custom dynamic wordpress theme for Twich channel host with extended features for advertisments, logo customizations, Twitch status updates, and Twitch chat, and Youtube based post generation. Extended user specific features and brand elements via custom child theme. User also required promotional material to support the brand."},{"id":2,"title":"Process","information":"Since the client was an active twitch host and had a robust collection of video game related video content available on his Youtube page, it was a core principle to seek to tie these two together on a single site. The scope of the project extended to supporting blog content since the client also is active in related hobbies, such as vaping, traveling to arcades in Japan, created music content, held a collection of video game material, and other personal content that would share the interets of the same audience. The current supported logo, was in need of refactor, and my first iteration to the site required a different approach that utilized Wordpress's features, as well as make it adoptable by other interested clients, or allow the client to scale his own in the future. I went about strategizing how content may be organized, easily edited, and updated, and what required dynamic elements.  planned how to best use the Youtube API, and implement communication between the site and the Twitch API endpoint for realtime status updates and chat accessibility.I also needed to recreate the brand and add a professional look to the channel host that would assist in generating a larger audience. I added Ad Space to the theme to in turn to generate revenue and in turn help keep the site active as users visited the site. Search Engine Optimization techniques were applied to further extend the reach for the site."}]}]}}