{"project":{"id":3,"title":"Match-up","services":["MOBILE DEVELOPMENT","GRAPHIC DESIGN","REACT NATIVE"],"image":"matchup_2.svg","shortdescription":"Application for fighters and gym owners to conveniently find sparring partners and schedule sparring","techKeywords":"React Native, iOS, Android, Redux, Firebase, Python","externallinks":[{"id":1,"name":"Git","svgref":"git","image":"git-icon.svg","url":"https://github.com/boomtechny"}],"sections":[{"sectionid":1,"sectiontitle":"Overview","subsections":[{"id":1,"title":"Brief","information":"As a gym owner or a fighter the user would like to find sparring partners based on specific parameters and submit to the potential sparring partner a request to setup sparring"},{"id":2,"title":"Process","information":"Utilized React Native and Redux to create a minium viable cross platform mobile application product. This involved first stategizing and establishing the core features necessary to meet the user criteria. I also had to methodically plan out user flow, by mapping out user stories, and establishing how to keep the experience simple and direct so that any user may install the app and get to fulfilling the task they sought out to do as seamless as possible. I also wanted to make sure users of the app can extend interest of using the app to other users. Scaling for future features of the app also had to be placed under consideration when planning how the user interface should work to prevent for updates extending the functionality of the app would not result in breaking other features. Another tenant of the project scope involved establishing how the app would be experienced by two different types of users. Users would need to query information about other users based on certain criteria, as well create and edit spar request forms sent to other others users. With these ideas in mind I planned out an optimal database strucutre necessary to delivery content to the UI. I decided to utilize Firebase to handle realtime data store as well as user authentication. Necessary image assets also had to be designed as well to support the user interface, so I went about creating a brand with supported typography, and color scheme that would suit the user interface."}]}]}}